[
  {
    "title": "AI Powered Communication Assistant",
    "imageSrc": "/assets/projects/ai_com.jpg",
    "details": [
      "Developed an AI-driven chat workflow to streamline professional profile inquiries and automate context-aware follow-ups.",
      "Implemented real-time AI notifications delivering inquiry details (name, email, and message summaries) for rapid response and engagement.",
      "Built with LangChain, LangGraph, and LangServe, leveraging the supervisor architecture for multi-agent coordination.",
      "Deployed a FastAPI backend as a Docker container on AWS App Runner, ensuring scalability and stateless concurrency handling.",
      "Hosted the React + Vite frontend on Netlify, integrated securely with the AWS backend via CORS and environment-based API routing.",
      "Managed environment variables, secrets, and deployment pipelines through AWS ECR, enabling reproducible and portable cloud builds."
    ],
    "skills": [
      "AWS App Runner",
      "AWS Elastic Container Registry",
      "Docker",
      "Python",
      "LangChain",
      "LangGraph",
      "LangServe",
      "Supervisor Architecture",
      "Large Language Models (LLMs)",
      "Workflow Automation",
      "Notification Systems",
      "Streamlit",
      "User Interface Design",
      "Real-Time Communication"
    ],
    "demo": "https://communicationagent.netlify.app/",
    "source": "https://github.com/AyanImran20/AI_communication_assistant",
    "paper": ""
  },

  {
    "title": "Cosmetic Product Safety Analysis (Machine Learning & AI)",
    "imageSrc": "/assets/projects/cosmetic_safety.png",
    "details": [
      "Developed a Python-based data analysis pipeline to detect harmful synthetic ingredients in marketed 'clean' beauty products.",
      "Integrated a safety scoring system (0–10) into the pipeline to quantify ingredient risk levels across multiple datasets.",
      "Created data visualizations to reveal a 73% discrepancy between product marketing claims and actual ingredient safety.",
      "Collaborated in a 3-person team to ensure model accuracy and reproducibility through well-documented scripts and pipelines."
    ],
    "skills": [
      "Python",
      "Pandas",
      "Matplotlib",
      "Machine Learning",
      "Data Pipelines",
      "Statistical Analysis",
      "Information Visualization"
    ],
    "demo": "",
    "source": "",
    "paper": ""
  },

  {
    "title": "Portfolio Website",
    "imageSrc": "/assets/projects/project.png",
    "details": [
      "Built with React, React Router DOM, and Tailwind CSS, featuring smooth animations and transitions.",
      "Implemented dark and light mode toggle with default theme settings.",
      "Designed a mobile-first, responsive UI with a clean and modern layout.",
      "Structured content via easily editable JSON configuration files for scalability and flexibility.",
      "Hosted the website on Netlify, allowing for continuous builds and update pipeline."
    ],
    "skills": [
      "React",
      "React Router DOM",
      "Tailwind CSS",
      "Responsive Design",
      "Mobile-First Development",
      "Dark/Light Mode",
      "Animations & Transitions",
      "JSON Configuration",
      "UI/UX Design",
      "Netlify"
    ],
    "demo": "https://ayan-imran-portfolio.netlify.app/",
    "source": "https://github.com/AyanImran20/personal_portfolio_website.git",
    "paper": ""
  }
]
